nguyenvo2304/mcu_lab1/stm32_lab1/stm32_lab1_ex6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CLOCK_0_Pin GPIO_PIN_4
#define CLOCK_0_GPIO_Port GPIOA
#define CLOCK_1_Pin GPIO_PIN_5
#define CLOCK_1_GPIO_Port GPIOA
#define CLOCK_2_Pin GPIO_PIN_6
#define CLOCK_2_GPIO_Port GPIOA
#define CLOCK_3_Pin GPIO_PIN_7
#define CLOCK_3_GPIO_Port GPIOA
#define CLOCK_4_Pin GPIO_PIN_8
#define CLOCK_4_GPIO_Port GPIOA
#define CLOCK_5_Pin GPIO_PIN_9
#define CLOCK_5_GPIO_Port GPIOA
#define CLOCK_6_Pin GPIO_PIN_10
#define CLOCK_6_GPIO_Port GPIOA
#define CLOCK_7_Pin GPIO_PIN_11
#define CLOCK_7_GPIO_Port GPIOA
#define CLOCK_8_Pin GPIO_PIN_12
#define CLOCK_8_GPIO_Port GPIOA
#define CLOCK_9_Pin GPIO_PIN_13
#define CLOCK_9_GPIO_Port GPIOA
#define CLOCK_10_Pin GPIO_PIN_14
#define CLOCK_10_GPIO_Port GPIOA
#define CLOCK_11_Pin GPIO_PIN_15
#define CLOCK_11_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
